from window import win

a=win()
u=a.u

u.add_paragraph((5,5),text='''(210727)同学在本次 12月阶段考试 中，各科成绩已汇总。
根据本校各学科排名，对标行政班型等级，结果如下：''')
u.add_table((5,50),data=[['学科','对标等级'],
                         ['语文','平行'],
                         ['数学','格致'],
                         ['英语','平行'],
                         ['物理','南山'],
                         ['化学','平行'],
                         ['政治','不建议选择该门学科'],
                         ['历史','平行'],
                         ['生物','南山'],
                         ['地理','南山']])
u.add_paragraph((240,50),text='班主任：')
u.add_link((300,50),'夏*','https:/?/')

u.add_paragraph((240,90),text='(210727)')
u.add_link((310,90),'学业评估','https:/?/')

a.go()
